# Arithmetic Operators

In [1]:
#Addition

3 + 5

8

In [2]:
# Subtraction

54 - 46

8

In [3]:
# Multiplication

2 * 3

6

In [4]:
# Division

35 /7

5.0

**We can't add to str to num**

In [5]:
"neeraj"+20

TypeError: can only concatenate str (not "int") to str

In [6]:
"neeraj"+"20"

'neeraj20'

In [7]:
"neeraj" * 5

'neerajneerajneerajneerajneeraj'

# Comparison Operators

In [8]:
# greater than

45 >34

True

In [9]:
# less than 

56 <23

False

In [10]:
34 * 34 < 45*23

False

In [11]:
45 == 45

True

# Logical Operators

In [12]:
# and operator

0 and 3

0

In [13]:
3 and 0

0

In [14]:
3 and 5

5

In [15]:
# or operator

0 or 3

3

In [16]:
3 or 0

3

In [17]:
3 or 5

3

# Variable Assignment

In [19]:
a = 5
print(a)
A = 4
print(A)

5
4

# How variables work in Python

In [20]:
a = 7
b = a
a = 3
print(a)

3

In [21]:
print(b)

7

# Variable naming rules

In [23]:
a = 5

In [22]:
_a=5

In [24]:
@a=5

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (759514597.py, line 1)

In [25]:
1a=5

SyntaxError: invalid decimal literal (2215310065.py, line 1)

# Data types

In [26]:
a =5
type(a)

int

In [27]:
b="neeraj"
type(b)

str

In [29]:
c=3.4
type(c)

float

# Problem 1 : Take a variable x and print "Even" if the number is divisible by 2, otherwise print "Odd".

In [30]:
x=4

if(x%2==0):
    print("Even")
else:
    print("Odd")

Even

# Problem 2 : Take a variable y and print "Grade A" if y is greater than 90, "Grade B" if y is greater than 60 but less than or equal to 90 and "Grade F" Otherwise.

In [31]:
y=90

if(y>90):
    print("Grade A")
elif(y>60):
    print("Grade B")
else:
    print("Grade F")

Grade B

# Problem 1: Write a for loop to print all the numbers between 10 and 50.

In [32]:
for i in range(11,50):
    print(i)

11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49

# Problem 2: Write a for loop to print all the add numbers between 10 and 50.

In [33]:
for i in range(11,50,2):
    print(i)

11
13
15
17
19
21
23
25
27
29
31
33
35
37
39
41
43
45
47
49

# Problem : Create a function that takes two numbers as argument and returns the greater of the two.

In [34]:
def compare(a,b):
    if(a>b):
        greater=a
    else:
        greater=b
    
    return greater

In [35]:
compare(10,50)

50

In [36]:
compare(14,5)

14

# List

In [38]:
#creating a list

marks=[1,2,3,4,5,6,7,8,9,10]

In [39]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [40]:
marks[5]

6

In [41]:
marks[0:6]

[1, 2, 3, 4, 5, 6]

In [42]:
#adding an element

marks.append(11)

In [43]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

In [44]:
marks.extend([12,13])

In [45]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

In [46]:
marks.append([14,15])

In [47]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, [14, 15]]

In [48]:
#deleting elements

marks.remove([14,15])

In [49]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

In [50]:
del marks[0]

In [51]:
marks

[2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

In [52]:
#accessing list elements

for mark in marks:
    print(mark)

2
3
4
5
6
7
8
9
10
11
12
13

In [53]:
for mark in marks:
    print(mark+1)

3
4
5
6
7
8
9
10
11
12
13
14

In [54]:
sam =[45, 36, 54, 78, 44]

In [55]:
sam

[45, 36, 54, 78, 44]

# Dictionary

In [56]:
#Creating a dictionary

marks={'history':45,'Geography':54,'Hindi':56}

In [57]:
marks

{'history': 45, 'Geography': 54, 'Hindi': 56}

In [58]:
# access elements

marks['Geography']

54

In [59]:
#adding elements

marks['english']=47

In [60]:
marks

{'history': 45, 'Geography': 54, 'Hindi': 56, 'english': 47}

In [61]:
marks.update({'Chemistry':89,'Physics':98})

In [62]:
marks

{'history': 45,
 'Geography': 54,
 'Hindi': 56,
 'english': 47,
 'Chemistry': 89,
 'Physics': 98}

In [63]:
del marks['Hindi']

In [64]:
marks

{'history': 45, 'Geography': 54, 'english': 47, 'Chemistry': 89, 'Physics': 98}

# Read

In [66]:
import pandas as pd

In [70]:
# Reading the csv file

df = pd.read_csv(r"C:\Users\mdine\Downloads\Dataframe+and+Basic+Operations\data.csv")
df.head()

,ID,Clump_Thickness,Cell_Size_Uniformity,Cell_Shape_Uniformity,Marginal_Adhesion,Single_Epithelial_Cell_Size,Bare_Nuclei,Bland_Chromatin,Normal_Nucleoli,Mitoses,Cancer_Type
0,1000025,5,1,1,1,2.0,1,3,1,1,2
1,1002945,5,4,4,5,NaN,10,3,2,1,2
2,1015425,3,1,1,1,2.0,2,3,1,1,2
3,1016277,6,8,8,1,3.0,4,3,7,1,2
4,1017023,4,1,1,3,2.0,1,3,1,1,2

In [68]:
# Reading excel file

df1 = pd.read_excel(r"C:\Users\mdine\Downloads\read1\read_csv\data.xlsx")
df1.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [72]:
# Seeing the dimensions of the df dataframe

df.shape

(699, 11)

In [73]:
df.tail(10)

,ID,Clump_Thickness,Cell_Size_Uniformity,Cell_Shape_Uniformity,Marginal_Adhesion,Single_Epithelial_Cell_Size,Bare_Nuclei,Bland_Chromatin,Normal_Nucleoli,Mitoses,Cancer_Type
689,654546,1,1,1,1,2.0,1,1,1,8,2
690,654546,1,1,1,3,2.0,1,1,1,1,2
691,695091,5,10,10,5,4.0,5,4,4,1,4
692,714039,3,1,1,1,2.0,1,1,1,1,2
693,763235,3,1,1,1,2.0,1,2,1,2,2
694,776715,3,1,1,1,3.0,2,1,1,1,2
695,841769,2,1,1,1,2.0,1,1,1,1,2
696,888820,5,10,10,3,7.0,3,8,10,2,4
697,897471,4,8,6,4,3.0,4,10,6,1,4
698,897471,4,8,8,5,4.0,5,10,4,1,4

In [74]:
# Seeing the names of the columns in the dataframe

df.columns

Index(['ID', 'Clump_Thickness', 'Cell_Size_Uniformity',
       'Cell_Shape_Uniformity', 'Marginal_Adhesion',
       'Single_Epithelial_Cell_Size', 'Bare_Nuclei', 'Bland_Chromatin',
       'Normal_Nucleoli', 'Mitoses', 'Cancer_Type'],
      dtype='object')

In [71]:
# Selecting a single column

df['Bare_Nuclei']

0       1
1      10
2       2
3       4
4       1
       ..
694     2
695     1
696     3
697     4
698     5
Name: Bare_Nuclei, Length: 699, dtype: object

In [75]:
# selecting multiple columns using names

df[['Bare_Nuclei', 'Cancer_Type']]

    Bare_Nuclei  Cancer_Type
0             1            2
1            10            2
2             2            2
3             4            2
4             1            2
..          ...          ...
694           2            2
695           1            2
696           3            4
697           4            4
698           5            4

[699 rows x 2 columns]

# Indexing

In [76]:
# selecting rows by their positions

df.iloc[:5]

,ID,Clump_Thickness,Cell_Size_Uniformity,Cell_Shape_Uniformity,Marginal_Adhesion,Single_Epithelial_Cell_Size,Bare_Nuclei,Bland_Chromatin,Normal_Nucleoli,Mitoses,Cancer_Type
0,1000025,5,1,1,1,2.0,1,3,1,1,2
1,1002945,5,4,4,5,NaN,10,3,2,1,2
2,1015425,3,1,1,1,2.0,2,3,1,1,2
3,1016277,6,8,8,1,3.0,4,3,7,1,2
4,1017023,4,1,1,3,2.0,1,3,1,1,2

In [77]:
# selecting columns by their positions

df.iloc[:,:2]

          ID  Clump_Thickness
0    1000025                5
1    1002945                5
2    1015425                3
3    1016277                6
4    1017023                4
..       ...              ...
694   776715                3
695   841769                2
696   888820                5
697   897471                4
698   897471                4

[699 rows x 2 columns]

In [78]:
df[df['Cancer_Type']==2]

,ID,Clump_Thickness,Cell_Size_Uniformity,Cell_Shape_Uniformity,Marginal_Adhesion,Single_Epithelial_Cell_Size,Bare_Nuclei,Bland_Chromatin,Normal_Nucleoli,Mitoses,Cancer_Type
0,1000025,5,1,1,1,2.0,1,3,1,1,2
1,1002945,5,4,4,5,NaN,10,3,2,1,2
2,1015425,3,1,1,1,2.0,2,3,1,1,2
3,1016277,6,8,8,1,3.0,4,3,7,1,2
4,1017023,4,1,1,3,2.0,1,3,1,1,2
...,...,...,...,...,...,...,...,...,...,...,...
690,654546,1,1,1,3,2.0,1,1,1,1,2
692,714039,3,1,1,1,2.0,1,1,1,1,2
693,763235,3,1,1,1,2.0,1,2,1,2,2
694,776715,3,1,1,1,3.0,2,1,1,1,2
695,841769,2,1,1,1,2.0,1,1,1,1,2

### Basics of Python
Fill valid code/values in place of blanks.

In [79]:
# initialize variables 'a' and 'b' with 5 and 6 respectively
a ='Hello'
b =' World'

# add 'a' and 'b' and assign the result into a new variable 'c'
c =a+b
print(c)

Hello World

In [80]:
# build a function to add 2 numbers
def addition(x,y):
    return(5+6)

# use the function 'addition' to add 'a' and 'b'
addition(a,b)

11

In [81]:
# create a list consisting of first 5 even numbers and print the list
my_list = [1,3,5,7,9]
print(my_list )

[1, 3, 5, 7, 9]

In [82]:
# access the 3rd element of the list 'my_list'
my_list[2]

5

In [83]:
# given below is a dictionary having 4 unique keys, i.e., 'name', 'age', 'gender', 'is_employed'
my_dict = {'name':'Smith',
           'age':34,
           'gender': 'Male',
           'is_employed': False}

# print 'my_dict'
print(my_dict)

{'name': 'Smith', 'age': 34, 'gender': 'Male', 'is_employed': False}

In [84]:
# access value under 'name' key from 'my_dict'
my_dict['name']

'Smith'

In [85]:
# update 'is_employed' key to True
my_dict.update({'is_employed':'No'})

# print the updated dictionary
print(my_dict)

{'name': 'Smith', 'age': 34, 'gender': 'Male', 'is_employed': 'No'}

In [86]:
# use a for loop to print only even numbers from the first 20 numbers, i.e. 1-20
for i in range(1,21):
    if i % 2 == 0:
        print(i)

2
4
6
8
10
12
14
16
18
20

# Please download the file "data_python.csv".

In [87]:
# import required libraries
import pandas as pd
import numpy as np

In [89]:
## read data_python.csv using pandas
mydata = pd.read_csv(r"C:\Users\mdine\Downloads\Data Science from Internshala\Module_2_Assignment_Data_Science\Module 2 Assignment Data Science\data_python.csv")

In [90]:
mydata.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [91]:
## print the number of rows and number of columns of mydata
mydata.shape

(614, 13)

In [93]:
## assign a variable 'target' with the 'Loan_Status' feature from mydata dataframe
target = mydata['Loan_Status']
target

0      Y
1      N
2      Y
3      Y
4      Y
      ..
609    Y
610    Y
611    Y
612    Y
613    N
Name: Loan_Status, Length: 614, dtype: object

In [94]:
## print the datatype of ApplicantIncome feature
print(mydata['ApplicantIncome'].dtypes)

int64

In [95]:
mydata.dtypes

Loan_ID               object
Gender                object
Married               object
Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

In [96]:
## conditional statement - print 'Yes' if the 21st element of 'Education' feature is 'Graduate' else print 'No'
if(mydata['Education'][20] == 'Graduate'):
    print('Yes')
else:
    print('no')

no

In [97]:
## print 31st to 35th rows of mydata
mydata.iloc[31:36]

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
31,LP001095,Male,No,0,Graduate,No,3167,0.0,74.0,360.0,1.0,Urban,N
32,LP001097,Male,No,1,Graduate,Yes,4692,0.0,106.0,360.0,1.0,Rural,N
33,LP001098,Male,Yes,0,Graduate,No,3500,1667.0,114.0,360.0,1.0,Semiurban,Y
34,LP001100,Male,No,3+,Graduate,No,12500,3000.0,320.0,360.0,1.0,Rural,N
35,LP001106,Male,Yes,0,Graduate,No,2275,2067.0,NaN,360.0,1.0,Urban,Y

In [98]:
## print first 5 rows of 2nd and 3rd column only
mydata.iloc[:5,2:4]

  Married Dependents
0      No          0
1     Yes          1
2     Yes          0
3     Yes          0
4      No          0